In [59]:
import pandas as pd
import numpy as np

In [4]:
pwd

'C:\\Users\\DACA\\IronHack\\DA_IH Workspace\\LABS\\Week 2\\Day 2'

In [5]:
ls ..

 Volume in drive C is Windows
 Volume Serial Number is 6244-AA37

 Directory of C:\Users\DACA\IronHack\DA_IH Workspace\LABS\Week 2

17/08/2021  12:19 PM    <DIR>          .
17/08/2021  12:19 PM    <DIR>          ..
17/08/2021  08:38 AM    <DIR>          Day 1
17/08/2021  01:46 PM    <DIR>          Day 2
               0 File(s)              0 bytes
               4 Dir(s)  30,527,778,816 bytes free

In [60]:
df1 = pd.read_csv("file1.csv")

In [46]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   ST                         1071 non-null   object
 2   GENDER                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   object
 5   Income                     1071 non-null   float64
 6   Monthly Premium Auto       1071 non-null   float64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [61]:
df2 = pd.read_csv("file2.csv")

In [7]:
#before merging the files, check the number of columns
set(df1.columns) == set(df2.columns)

True

In [62]:
df3 = pd.concat([df1,df2],axis = 0, ignore_index = True)

In [49]:
df3.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [63]:
df3.columns = [i.lower().replace(" ","_") for i in df3.columns]
df3.head()

,customer,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [51]:
list(df3.columns)

['customer',
 'st',
 'gender',
 'education',
 'customer_lifetime_value',
 'income',
 'monthly_premium_auto',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'total_claim_amount']

In [64]:
df4 = df3.drop(columns = "customer")

In [65]:
df4.head()

,st,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [66]:
#rearranging columns

df5 = df4[['st',
 'gender',
 'education',
 'customer_lifetime_value',
 'number_of_open_complaints',
 'policy_type',
 'vehicle_class',
 'income',
 'monthly_premium_auto',
 'total_claim_amount']]

df5.head()

,st,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class,income,monthly_premium_auto,total_claim_amount
0,Washington,NaN,Master,NaN,1/0/00,Personal Auto,Four-Door Car,0.0,1000.0,2.704934
1,Arizona,F,Bachelor,697953.59%,1/0/00,Personal Auto,Four-Door Car,0.0,94.0,1131.464935
2,Nevada,F,Bachelor,1288743.17%,1/0/00,Personal Auto,Two-Door Car,48767.0,108.0,566.472247
3,California,M,Bachelor,764586.18%,1/0/00,Corporate Auto,SUV,0.0,106.0,529.881344
4,Washington,M,High School or Below,536307.65%,1/0/00,Personal Auto,Four-Door Car,36357.0,68.0,17.269323

In [67]:
df5["number_of_open_complaints"].value_counts()

1/0/00    1626
1/1/00     247
1/2/00      93
1/3/00      60
1/4/00      29
1/5/00      12
Name: number_of_open_complaints, dtype: int64

In [68]:
df5['customer_lifetime_value'].value_counts()

251459.20%     5
552821.28%     5
445811.34%     4
343613.43%     4
871704.98%     4
              ..
575991.08%     1
1511440.24%    1
988038.58%     1
2919436.64%    1
399258.39%     1
Name: customer_lifetime_value, Length: 1923, dtype: int64

In [69]:
def func2(x):
    x = str(x)
    
    if x.lower() == "nan":
        return 0
    else: 
        return int(x[2])
df5["number_of_open_complaints"] = df5["number_of_open_complaints"].apply(func2)
df5.head()

,st,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class,income,monthly_premium_auto,total_claim_amount
0,Washington,NaN,Master,NaN,0,Personal Auto,Four-Door Car,0.0,1000.0,2.704934
1,Arizona,F,Bachelor,697953.59%,0,Personal Auto,Four-Door Car,0.0,94.0,1131.464935
2,Nevada,F,Bachelor,1288743.17%,0,Personal Auto,Two-Door Car,48767.0,108.0,566.472247
3,California,M,Bachelor,764586.18%,0,Corporate Auto,SUV,0.0,106.0,529.881344
4,Washington,M,High School or Below,536307.65%,0,Personal Auto,Four-Door Car,36357.0,68.0,17.269323

In [72]:
type(df5['number_of_open_complaints'][0])

numpy.int64

In [87]:
df6 = df5.drop_duplicates()
df6.head()

,st,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class,income,monthly_premium_auto,total_claim_amount
0,Washington,NaN,Master,NaN,0,Personal Auto,Four-Door Car,0.0,1000.0,2.704934
1,Arizona,F,Bachelor,697953.59%,0,Personal Auto,Four-Door Car,0.0,94.0,1131.464935
2,Nevada,F,Bachelor,1288743.17%,0,Personal Auto,Two-Door Car,48767.0,108.0,566.472247
3,California,M,Bachelor,764586.18%,0,Corporate Auto,SUV,0.0,106.0,529.881344
4,Washington,M,High School or Below,536307.65%,0,Personal Auto,Four-Door Car,36357.0,68.0,17.269323

In [88]:
df6.isna().any()

st                            True
gender                        True
education                     True
customer_lifetime_value       True
number_of_open_complaints    False
policy_type                   True
vehicle_class                 True
income                        True
monthly_premium_auto          True
total_claim_amount            True
dtype: bool

In [89]:
#filtering data

df6['st'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [90]:
def state_cl(x):
    dct = {'Washington':'WA',
              'Arizona':'AZ',
               'Nevada':'NV',
               'California':'CA',
               'Cali':'CA',
               'Oregon':'OR',
               'AZ':'AZ',
               'WA':'WA',
                'NV':"NV"}
    if not x==x:
        #then I know that x is NaN
        return x
    else:
        return dct[x]
state_cl('NV')

'NV'

In [91]:
df6['st'] = df6['st'].apply(state_cl)

<ipython-input-91-b5823172ae6f>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['st'] = df6['st'].apply(state_cl)

In [92]:
df6['st'].unique()

array(['WA', 'AZ', 'NV', 'CA', 'OR', nan], dtype=object)

In [93]:
df6['gender'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [ ]:
#(df['gender'] == 'Femal') | (df['gender'] == 'Male') | (df['gender'] == 'Male')

In [42]:
#df6[df6['gender'].apply(lambda x: x in ('female','Male', 'Femal'))]
#use apply() function to filter

In [38]:
def my_func(x):
    return x**2
my_func(4)

16

In [39]:
lambda x: x**2

In [40]:
#blueprint, the bare function, without a name
#can be used within apply()
(lambda x: x**2)(4)

16

In [97]:
#standardise the gender column

def gender_cl(x):
    dct = {'female':'F',
          'Male':'M',
          'Femal':'F',
           'F':'F',
           'M':'M'}
    if not x==x:
        #then I know that x is NaN
        return 'N'
    else:
    
        return dct[x]
gender_cl('Male')

'M'

In [98]:
df6['gender'] = df6['gender'].apply(gender_cl)

<ipython-input-98-9ec615ae77af>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['gender'] = df6['gender'].apply(gender_cl)

In [99]:
df6['region'] = [" "]*df6.shape[0]
df6.head()

<ipython-input-99-d0e4816b0038>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['region'] = [" "]*df6.shape[0]

,st,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class,income,monthly_premium_auto,total_claim_amount,region
0,WA,N,Master,NaN,0,Personal Auto,Four-Door Car,0.0,1000.0,2.704934,
1,AZ,F,Bachelor,697953.59%,0,Personal Auto,Four-Door Car,0.0,94.0,1131.464935,
2,NV,F,Bachelor,1288743.17%,0,Personal Auto,Two-Door Car,48767.0,108.0,566.472247,
3,CA,M,Bachelor,764586.18%,0,Corporate Auto,SUV,0.0,106.0,529.881344,
4,WA,M,High School or Below,536307.65%,0,Personal Auto,Four-Door Car,36357.0,68.0,17.269323,

In [100]:
def region(x):  
    dct = {'CA':'West Region',
                 'WA':'East',
                 'OR':'North West',
                 'AZ':'Central',
                 'NV':'Central'}
    if x !=x:
        return x
    else:        
        return dct[x]
region('CA')

'West Region'

In [101]:
df6['region'] = df6['st'].apply(region)
df6.head()

<ipython-input-101-922e8054d27c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['region'] = df6['st'].apply(region)

,st,gender,education,customer_lifetime_value,number_of_open_complaints,policy_type,vehicle_class,income,monthly_premium_auto,total_claim_amount,region
0,WA,N,Master,NaN,0,Personal Auto,Four-Door Car,0.0,1000.0,2.704934,East
1,AZ,F,Bachelor,697953.59%,0,Personal Auto,Four-Door Car,0.0,94.0,1131.464935,Central
2,NV,F,Bachelor,1288743.17%,0,Personal Auto,Two-Door Car,48767.0,108.0,566.472247,Central
3,CA,M,Bachelor,764586.18%,0,Corporate Auto,SUV,0.0,106.0,529.881344,West Region
4,WA,M,High School or Below,536307.65%,0,Personal Auto,Four-Door Car,36357.0,68.0,17.269323,East